app/views/students/show.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."student_id" = ? ORDER BY priority_level DESC  [["student_id", 2]]
---

    <% @student.favorites.each do |fave_var| %>