app/views/words/show.erb

SELECT "definitions".* FROM "definitions" WHERE "definitions"."word_id" = ? ORDER BY created_at DESC  [["word_id", 13]]
---
<ul>
<% @word.definitions.each do |definition| %>