app/controllers/definitions_controller.rb

  def new
    @definition = Definition.new
    @words = Word.all
---
SELECT "words".* FROM "words"

  def edit
    @words = Word.all
---
SELECT "words".* FROM "words"

  def find_definition
    @definition = Definition.find(params[:id])
---
SELECT "definitions".* FROM "definitions" WHERE "definitions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]