app/controllers/favorites_controller.rb

    def new
        @favorite = Favorite.new
        @students = Student.all
        @words = Word.all - @current_student.words
---
SELECT "students".* FROM "students"
SELECT "words".* FROM "words" INNER JOIN "favorites" ON "words"."id" = "favorites"."word_id" WHERE "favorites"."student_id" = ? ORDER BY priority_level DESC  [["student_id", 4]]

    def create
        # byebug
        favorite_params = params.require(:favorite).permit(:priority_level, :word_id)

        @favorite = @current_student.favorites.create(favorite_params)
---
INSERT INTO "favorites" ("priority_level", "student_id", "word_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["priority_level", 4], ["student_id", 4], ["word_id", 9], ["created_at", "2020-09-04 18:59:20.702699"], ["updated_at", "2020-09-04 18:59:20.702699"]]