app/controllers/students_controller.rb

UPDATE "students" SET "age" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 31], ["last_name", "Vargas!"], ["updated_at", "2020-09-08 18:14:03.540044"], ["id", 2]]
---
  def increase_age
    new_age_var = @current_student.age + params[:age_to_increase].to_i
    @current_student.update(age: new_age_var, last_name: @current_student.last_name + "!")

SELECT "students".* FROM "students" WHERE "students"."first_name" = ? ORDER BY "students"."first_name" ASC LIMIT ?  [["first_name", "Eric"], ["LIMIT", 1]]
---
  def handle_login
    @student = Student.find_by(first_name: params[:first_name])

SELECT "students".* FROM "students" ORDER BY  DESC first_name
---
  def index
    @students = Student.all

INSERT INTO "students" ("first_name", "last_name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Annie"], ["last_name", "Zheng"], ["age", 5987489675], ["created_at", "2020-08-26 19:07:47.500550"], ["updated_at", "2020-08-26 19:07:47.500550"]]
---
  def create
  @student = Student.create(student_params)

UPDATE "students" SET "password_digest" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["password_digest", "$2a$12$9wI7H7O4tGVR0GP56krD3eC5S2lcrO0u3Yv.PNbv55jfbMU2/tdQK"], ["updated_at", "2020-09-08 18:47:41.021414"], ["id", 1]]
---
  def update
    @student.update(student_params)