app/controllers/words_controller.rb

DELETE FROM "words" WHERE "words"."id" = ?  [["id", 2]]
---
  def destroy
    @word.destroy

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def find_word
    @word = Word.find(params[:id])